work_type_ids = {
    1: {
        "name": "Лущение стерни дисковыми орудиями типа ЛДГ  глубина обр. 6-8 см",
    },
    2: {
        "name": "Лущение стерни дисковыми орудиями типа ЛДГ глубина обр. 8-10",
    },
    3: {
        "name": "Дискование стерни Боронами типа БД",
    },
    4: {
        "name": "Боронование почвы Сетчатыми боронами",
    },
    5: {
        "name": "Боронование почвы Зубовыми боронами",
    },
    6: {
        "name": "Боронование почвы Ножевыми боронами",
    },
    7: {
        "name": "Боронование почвы пружинными боронами",
    },
    8: {
        "name": "Прикатывание почвы гладкими катками, кольчато-шпоровыми",
    },
    9: {
        "name": "Вспашка почвы прицепным плугом",
    },
    10: {
        "name": "Зерноуборочные работы",
    },
    11: {
        "name": "Кормоуборочные работы",
    },
    12: {
        "name": "Картофелеуборочные работы",
    },
    13: {
        "name": "Свеклоуборочные работы",
    },
    14: {
        "name": "Глубокое рыхление почвы агрегатами типа ПРПВ 27-30 см",
        "rating": 12,
    },
    15: {
        "name": "Глубокое рыхление почвы агрегатами типа ПРПВ 30-35 см",
        "rating": 13,
    },
    16: {
        "name": "Глубокое рыхление почвы агрегатами типа ПРПВ 40 -43 см",
        "rating": 16,
    },
    17: {
        "name": "Дискование зяби боронами типа БД 8-10 см",
        "rating": -2,
    },
    18: {
        "name": "Дискование зяби боронами типа БДТ 8-10 см",
        "rating": -1,
    },
    19: {
        "name": "Дискование стерни Боронами типа БДТ 10-12 см",
        "rating": 1,
    },
    20: {
        "name": "Дискование стерни Боронами типа БДТ 6-8 см",
        "rating": -3,
    },
    21: {
        "name": "Дискование стерни Боронами типа БДТ 8-10 см",
        "rating": -1,
    },
    22: {
        "name": "Лемешное лущение стерни 10-12 см",
        "rating": -7,
    },
    23: {
        "name": "Лемешное лущение стерни 12-14 см",
        "rating": 3,
    },
    24: {
        "name": "Междурядная культивация без внесения удобрений 10-12 см",
        "rating": 1,
    },
    25: {
        "name": "Междурядная культивация без внесения удобрений 4-6 см",
        "rating": -3,
    },
    26: {
        "name": "Междурядная культивация без внесения удобрений 6-8 см",
        "rating": -2,
    },
    27: {
        "name": "Междурядная культивация без внесения удобрений 8-10 см",
        "rating": 0,
    },
    28: {
        "name": "Междурядная культивация с внесением удобрений  10-12 см",
        "rating": 1,
    },
    29: {
        "name": "Междурядная культивация с внесением удобрений  12-14 см",
        "rating": 1,
    },
    30: {
        "name": "Междурядная культивация с внесением удобрений  4-6 см",
        "rating": -3,
    },
    31: {
        "name": "Междурядная культивация с внесением удобрений  6-8 см",
        "rating": -2,
    },
    32: {
        "name": "Междурядная культивация с внесением удобрений  8-10 см",
        "rating": -1,
    },
    33: {
        "name": "Обработка почвы комбинированными агрегатами типа АКП,АКВ,КМ 8-10 см",
        "rating": 1,
    },
    34: {
        "name": "Обработка почвы комбинированными агрегатами типа АКП,АКВ,КМ 10-12 см",
        "rating": 2,
    },
    35: {
        "name": "Обработка почвы комбинированными агрегатами типа АКП,АКВ,КМ 12-14 см",
        "rating": 3,
    },
    36: {
        "name": "Обработка почвы комбинированными агрегатами типа АКП,АКВ,КМ 16-18 см",
        "rating": 5,
    },
    37: {
        "name": "Обработка почвы плоскорезами типа КПГ, ПГ. 25-27 см",
        "rating": 10,
    },
    38: {
        "name": "Обработка почвы плоскорезами типа КПГ, ПГ. 28-30 см",
        "rating": 12,
    },
    39: {
        "name": "Обработка почвы плоскорезами типа КПШ 8-10 см",
        "rating": 0,
    },
    40: {
        "name": "Обработка почвы плоскорезами типа КПШ 10-12 см",
        "rating": 1,
    },
    41: {
        "name": "Посев зерновых колосовых по стерне комбинированными агрегатами типа АУП",
        "rating": -1,
    },
    42: {
        "name": "Посев зерновых колосовых сеялками типа СЗ без внесения удобрений",
        "rating": -4,
    },
    43: {
        "name": "Посев зерновых колосовых сеялками типа СЗ с внесением удобрений",
        "rating": -4,
    },
    44: {
        "name": "Посев кукурузы и подсолнечника сеялками тиа СУПН",
        "rating": -3,
    },
    45: {
        "name": "Посев сахарной свеклы (сои) сеялками типа ССТ",
        "rating": -3,
    },
    46: {
        "name": "Прикатывание посевов",
        "rating": -8,
    },
    47: {
        "name": "Прямой посев зерновых колосовых сеялками типа СЗС",
        "rating": -3,
    },
    48: {
        "name": "Рыхление почвы без оборота пласта агрегатами типа ОПО-4,25 14-16 см",
        "rating": 3,
    },
    49: {
        "name": "Рыхление почвы без оборота пласта агрегатами типа ОПО-4,25 6-8 см",
        "rating": -1,
    },
    50: {
        "name": "Сплошная культивация почвы культиваторами типа КТП, КТС, КПЭ, КШУ 6-8 см",
        "rating": -1,
    },
    51: {
        "name": "Сплошная культивация почвы культиваторами типа КТП, КТС, КПЭ, КШУ  8- 10 см",
        "rating": 0,
    },
    52: {
        "name": "Сплошная культивация почвы культиваторами типа КТП, КТС, КПЭ, КШУ 10 - 12 см",
        "rating": 1,
    },
    53: {
        "name": "Сплошная культивация почвы культиваторами типа КТП, КТС, КПЭ, КШУ  12-14  см",
        "rating": 3,
    },
    54: {
        "name": "Сплошная культивация почвы культиваторами типа КТП, КТС, КПЭ, КШУ  14-16  см",
        "rating": 4,
    },
    55: {
        "name": "Чизельное рыхление почвы агрегатми типа ПЧНК, ПЧ. 16-16 см",
        "rating": 3,
    },
    56: {
        "name": "Чизельное рыхление почвы агрегатми типа ПЧНК, ПЧ. 30-35 см",
        "rating": 14,
    },
    57: {
        "name": "Чизельное рыхление почвы агрегатми типа ПЧНК, ПЧ. 35-40 см",
        "rating": 15,
    },
}

soil_background_ids = {
    1: {
        "name": "Залежь, пласт много летних трав, уплотненная стерня",
        "rating": 12,
    },
    2: {
        "name": "Стерня зерновых колосовых и однолетних трав",
        "rating": 9,
    },
    3: {
        "name": "Поле после уборки кукурузы и подсолнечника",
        "rating": 6,
    },
    4: {
        "name": "дискованная стерня",
        "rating": 3,
    },
    5: {
        "name": "Поле подготовленно под посев",
        "rating": 0,
    },
    6: {
        "name": "культивированное поле дисковання пашня",
        "rating": -3,
    },
    7: {
        "name": "Слежавшаяся уплотненная пашня",
        "rating": -6,
    },
    8: {
        "name": "Свежевспаханное поле",
        "rating": -9,
    },
}


def get_tyagovoe_type_14_57(ukl, work_type, soil_background, tp):
    rating = 0
    rating += work_type_ids[work_type]["rating"]
    rating += soil_background_ids[soil_background]["rating"]
    rating += (ukl - 0.7) * 10
    match tp:
        case "Легкие":
            rating += -9
        case "Средние":
            rating += -3
        case "Тяжелые":
            rating += 5
        case "Весьма тяжелые":
            rating += 12
    if rating < -25:
        return 0
    if rating < -10:
        return 1
    if rating < 5:
        return 2
    if rating < 15:
        return 3
    return 4
